tutorials/poolfireMcCaffrey/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
	(-1.5 -1.5 0)
	( 1.5 -1.5 0)
	( 1.5  1.5 0)
	(-1.5  1.5 0)
	(-1.5 -1.5 3)
	( 1.5 -1.5 3)
	( 1.5  1.5 3)
	(-1.5  1.5 3)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch base0
    (
	(0 3 2 1)
    )
    patch sides
    (
	(0 4 7 3)
	(1 2 6 5)
	(0 1 5 4)
	(2 3 7 6)
    )
    patch outlet
    (
	(4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
