tutorials/poolfireMcCaffrey/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  eddyDissipationModel;

active  true;

eddyDissipationModelCoeffs
{
    semiImplicit no;
    C_EDC       4.0;
    C_Diff      4.0; 
    C_Stiff     1;
}

// ************************************************************************* //
