tutorials/poolfireMcCaffrey/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {

        type            pressureInletOutletVelocity;
        value           $internalField;
	inletValue	uniform (0 0 0);

    }

    sides
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    base
    {
        type            noSlip;
    }

    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    0.001149; //58kW 
	//massFlowRate	 0.000897; //45kW
	//massFlowRate	 0.000660; //33kW
	//massFlowRate	 0.000434; //22kW
	//massFlowRate   0.000288; //14kW
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
