tutorials/poolfireMcCaffrey/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class        dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    sets;
libs    ("libsampling.so");
setFormat raw;
surfaceFormat raw;//foam;

interpolationScheme cellPoint;
//interpolationScheme cell;
//interpolationScheme cellPointFace;

fields
(
 	T
	U
	phi
	phiHc
	TMean
	UMean
	TPrime2Mean
	UPrime2Mean
	phiMean
	phiHcMean
);

sets
(
    lines_z
    {
        type    face;
        axis    z;
        start   (0. 0. 0.);
        end     (0. 0. 3.);
        nPoints 100;
    }
);

